//==============================================Задание №1===================================//
// const firstArray = ['a', 'b', 'c'];
// const secondArray = [1, 2, 3];
// const newArray = [...firstArray, ...secondArray];
// console.log(newArray);
//==============================================Задание №2===================================//
// const firstArray = ['a', 'b', 'c'];
//  firstArray.push(1,2,3);
// console.log(firstArray);
//-------------------------------------------------------------------------------------------//
// const firstArray = ['a', 'b', 'c'];
//  firstArray.splice(3,0, 1, 2, 3);
// console.log(firstArray);
//==============================================Задание №3===================================//
// const firstArray = [1, 2, 3, 4, 5];
// firstArray.splice(1,2);
// console.log(firstArray);
//==============================================Задание №4===================================//
// const firstArray = [1, 2, 3, 4, 5];
// firstArray.splice(3, 0, 'a', 'b', 'c');
// console.log(firstArray);
//==============================================Задание №5===================================//
// const arr = [1, 2, 3, 4, 5]
// const arr1 = new Array(...arr);
// let multiplication = multiplicationNumber(arr1);
// console.log(multiplication);
// function multiplicationNumber(array) {
//     return array.map(function(num) {
//         return num * 10;
//     });
// }
//==============================================Задание №6===================================//
// for (var i = 4; i <= 400; i++) {
//     console.log(i)
// }
//==============================================Задание №7===================================//
// for (var i = 4; i <= 13; i += 3) {
//     console.log(i)
// }
//==============================================Задание №8===================================//
// for (var i = 654; i >= 0; i -= 1) {
//     console.log(i)
// }
//==============================================Задание №9===================================//
// for (var i = 1983; i <= 2017; i += 1) {
//     console.log(i)
// }
//==============================================Задание №10==================================//
//  for (var i = -4; i <= 100; i += 1) {
//      console.log(i)
//  }
//==============================================Задание №11==================================//
// const arr = [];
// let sum = 0;
// for (let i = 1; i <= 100; i++) {
//     sum += i;
// }
// arr.push(sum);
// console.log(arr);
//==============================================Задание №12==================================//
// const arr = [];
// let str = '';
// let n = +prompt('Введите длину масива')
// for (var i=0; i < n; i++) {
//     str += 'x';
//     arr.push(str);
// }
// console.log(arr);
//==============================================Задание №13==================================//
// let n = +prompt('Введите длину масива')
// const arr = [];
// let str;
// for (var i=1; i<n; i++) {
//     str = '';
//     for (var j=1; j<=i; j++) {
//         str += i;
//     }
//     arr.push(str);
// }
// console.log(arr);
//==============================================Задание №14==================================//
